// 第二章
// 2.12 运算符优先级与求值次序

/*
 * 运算符的优先级和结合性后续会放在OneNote中。
 *
 * 一元运算符+、-、&与*的优先级比相应的二元运算符+、-、&与*的优先级高。
 * 位运算符&、^与|的优先级比运算符==与！=的低。这意味着，位测试表达式如
 * if ((x & MASK) == 0)...
 * 必须用圆括号括起来才能得到正确结果。
 *
 * C语言没有指定同一运算符中多个操作数的计算顺序（&&、||、？=和","运算符除外）。
 * 例如，在形如
 * x = f() + g();
 * 的语句中，f()可以在g()之前计算，也可以在g()之后运算。因此，如果函数f或g改变了
 * 另一个函数所使用的变量，那么x的结果可能会依赖于这两个函数的计算顺序。
 * 为了保证特定的计算顺序，可以把中间结果保存在临时变量中。
 *
 * 类似的，C语言也没有指定函数各参数的求值顺序。因此，下列语句
 * printf("%d %d\n", ++n, power(2, n)); // 错
 * 在不同的编译器中可能会产生不同的结果，这取决于n的自增运算在power调用之前还是之后执行。
 * 解决的办法是把该语句改写成下列形式：
 * ++n;
 * printf("%d %d\n", n, power(2, n));
 * 函数调用、嵌套赋值语句、自增于自减运算符都有可能产生“副作用”--在对表达式求值的同时，
 * 修改了某些变量的值。在有副作用影响的表达式中，其执行结果于表达式中的变量修改的顺序
 * 之间存在着微妙的依赖关系。下列语句就是一个典型的令人不愉快的情况：
 * a[i] = i++;
 * 问题是：数组下标i是引用旧值还是引用新值？于编译器有关。
 *
 * */
