#include <stdio.h>

// 练习1-4逆程序（即按照从300度到0度的顺序）打印温度转换表
main() {
    int fahr; // 华氏温度

    printf("华氏温度\t摄氏温度\n");
    for (fahr = 300; fahr >= 0; fahr=fahr-20) {
        printf("%4d\t%6.1f\n", fahr, (5.0/9.0)*(fahr-32.0));
    }

    // 程序部分输出
  /*华氏温度	摄氏温度
    300	 148.9
    280	 137.8
    260	 126.7
    240	 115.6
    220	 104.4
    200	  93.3
    180	  82.2
    160	  71.1
    140	  60.0
    120	  48.9
    100	  37.8
    80	  26.7
    60	  15.6
    40	   4.4
    20	  -6.7
    0	 -17.8
    */

}